cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'd12frosted/emacs-plus'

brew 'emacs-plus'
brew 'percol'
brew 'fzf'
brew 'autojump'

brew 'ack'
brew 'coreutils'
brew 'go'
brew 'openssl'
brew 'readline'
brew 'postgresql'
brew 'spaceman-diff'
brew 'unrar'
brew 'wget'

cask 'firefox'
cask 'google-chrome'
