cask_args appdir: '/Applications'

brew 'the_silver_searcher' # using for emacs helm-ag, C-c C-s

# terminal commands
brew 'percol'
brew 'fzf'
brew 'autojump'
brew 'tree'
brew 'tmux'
brew 'zsh-syntax-highlighting'

brew 'ack'
brew 'coreutils'
brew 'openssl'
brew 'readline'
brew 'spaceman-diff'
brew 'unrar'
brew 'wget'
brew 'watchman'
brew 'emacs'

# programming language
brew 'chezscheme'
brew 'stack'

cask 'font-source-code-pro'
cask 'iterm2'
